In [5]:
#### Read in the data ####

In [6]:
import pandas as pd

#### Load the Diwali sales dataset

In [7]:
df = pd.read_csv("info-511-s25/ae/data/diwali_sales_data.csv", encoding='iso-8859-1')

#### Display basic dataset information

In [8]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           11251 non-null  int64
 1   Cust_name         11251 non-null  object
 2   Product_ID        11251 non-null  object
 3   Gender            11251 non-null  object
 4   Age Group         11251 non-null  object
 5   Age               11251 non-null  int64
 6   Marital_Status    11251 non-null  int64
 7   State             11251 non-null  object
 8   Zone              11251 non-null  object
 9   Occupation        11251 non-null  object
 10  Product_Category  11251 non-null  object
 11  Orders            11251 non-null  int64
 12  Amount            11239 non-null  float64
dtypes: float64(1), int64(4), object(8)
memory usage: 1.1+ MB

            User_ID           Age  Marital_Status        Orders        Amount
count  1.125100e+04  11251.000000    11251.000000  11251.000000  11239.000000
mean   1.003004e+06     35.421207        0.420318      2.489290   9453.610858
std    1.716125e+03     12.754122        0.493632      1.115047   5222.355869
min    1.000001e+06     12.000000        0.000000      1.000000    188.000000
25%    1.001492e+06     27.000000        0.000000      1.500000   5443.000000
50%    1.003065e+06     33.000000        0.000000      2.000000   8109.000000
75%    1.004430e+06     43.000000        1.000000      3.000000  12675.000000
max    1.006040e+06     92.000000        1.000000      4.000000  23952.000000

#### Narrative - This one was a little easier. We imported the package pandas as pd. Then we imported the dataset "Diwali Sales" and then we displayed basic information about the dataset and basic statistics. Note - I used ChatGPT to figure out the pathway. I think the issue is that everytime I reopen the terminal, I don't have the right directory pathway to the data.  It takes me a minute to remember how to direct to the right directory. ####

#### Identify and display the unique values in each categorical column

"""We set the variable "categorical_columns" equal to the dataframe "df" and the method select_dtypes in the list "objects" and extracts the names of the columns
Then we iterate in the loop "for col in" over the variable 'categorical_columns. Then we print the formatted string "unique values in" the set col, print the unique values in the dataframe list col, then we add a separate line by printing "\n" as we iterate. """

In [9]:
categorical_columns = df.select_dtypes(include=['object']).columns

for col in categorical_columns:
    print(f"Unique values in '[col]':")
    print(df[col].unique())
    print("\n")

Unique values in '[col]':
['Sanskriti' 'Kartik' 'Bindu' ... 'Chris' 'Madan Mohan' 'Nicole']


Unique values in '[col]':
['P00125942' 'P00110942' 'P00118542' ... 'P00307142' 'P00044742'
 'P00296942']


Unique values in '[col]':
['F' 'M']


Unique values in '[col]':
['26-35' '0-17' '18-25' '55+' '46-50' '51-55' '36-45']


Unique values in '[col]':
['Maharashtra' 'Andhra Pradesh' 'Uttar Pradesh' 'Karnataka' 'Gujarat'
 'Himachal Pradesh' 'Delhi' 'Madhya Pradesh' 'Jharkhand' 'Kerala'
 'Haryana' 'Bihar' 'Rajasthan' 'Uttarakhand' 'Telangana' 'Punjab']


Unique values in '[col]':
['Western' 'Southern' 'Central' 'Northern' 'Eastern']


Unique values in '[col]':
['Healthcare' 'Govt' 'Automobile' 'Construction' 'Food Processing'
 'Lawyer' 'IT Sector' 'Media' 'Banking' 'Retail' 'Hospitality' 'Aviation'
 'Agriculture' 'Textile' 'Chemical']


Unique values in '[col]':
['Auto' 'Hand & Power Tools' 'Stationery' 'Tupperware' 'Footwear & Shoes'
 'Furniture' 'Food' 'Games & Toys' 'Sports Products' 'Books'
 'Electronics & Gadgets' 'Decor' 'Clothing & Apparel' 'Beauty'
 'Household items' 'Pet Care' 'Veterinary' 'Office']